app/controllers/api/v1/users_controller.rb

  def create
    @user = User.new()
		@user.email = params[:user][:email]
		@user.password = params[:user][:password]
		@user.save
---
INSERT INTO `users` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_sign_in_at`, `last_sign_in_ip`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`) VALUES ('2014-09-18 03:57:52', NULL, NULL, 'eveerababu_nyros@yahoo.com', '$2a$10$VVp6OpOydV.PoAwzgaZD..J2B6iZiFIlgKSQv1JViqfGEefKMqgWW', NULL, NULL, NULL, NULL, NULL, 0, '2014-09-18 03:57:52')