app/controllers/posts_controller.rb

  def index
    respond_with(@posts = Post.all)
---
SELECT `posts`.* FROM `posts`

  def create
		puts "#########################################"
		puts params[:name].inspect
		@post_find = Post.find_by_name(params[:name])
		if @post_find.nil?
	    @post = Post.new(params[:post])
  	  @post.save
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`name` = 'Angular' LIMIT 1
INSERT INTO "posts" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 05 Sep 2014 09:40:35 UTC +00:00], ["description", "fsda"], ["name", "dfas"], ["updated_at", Fri, 05 Sep 2014 09:40:35 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "14"]]
UPDATE "posts" SET "description" = 'testing this post', "name" = 'Tested', "updated_at" = '2014-09-15 06:23:49.309367' WHERE "posts"."id" = 14