app/controllers/projects_controller.rb

  def index
    @projects = current_user.projects.all
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`user_id` = 1

  def create
		puts "#############################################"
		puts params.inspect
    @project = Project.new(params[:project])
		#@project.description = params[:proejct][:description]
		#@project.name = params[:project][:name]
		@project.user_id = current_user.id
		@project.save
---
INSERT INTO `projects` (`created_at`, `description`, `name`, `updated_at`, `user_id`) VALUES ('2014-09-18 06:43:00', 'EditBlink is mainly used for paragraph corrections........', 'EditBlink', '2014-09-18 06:43:00', NULL)

  def update
    @project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 4 LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 4